beardedmonads.org
#+TITLE: Functional programming and Bearded.Monads
#+AUTHOR: Khan Thompson
#+EMAIL: khanage@gmail.com
#+REVEAL_ROOT: http://cdn.jsdelivr.net/reveal.js/3.0.0/
#+OPTIONS: num:nil toc:nil time:nil

* Functional programming

- Programming without changing anything.
- Math is function programming is math.

** Why not just mutate, it's easy?

- Multi threading.
- Equational reasoning.

** Why not just use the functional approach?

- It's not what we were taught.
- It can be awkward.

* Some classes

- There are some typeclasses (think interfaces) which have unreasonable effectiveness.
- They have weird names, so I'll explain them as best I can.

** Functor

A container for values, e.g. has a type parameter.
It defines an operation that lets one change the type in the context of the container.
#+BEGIN_SRC csharp
// We can change the type of the functor from `A` to `B`.
interface Functor<A> {
  Functor<B> Select<B>(Func<A,B> f);
}
#+END_SRC

- a list is a functor (it contains values).
- a task is a functor (it has a value that will be available in time).
- an option is a functor (it may or may not have a value).

** Foldable

Something we can reduce to another value, with a function combining each value in the container.
#+BEGIN_SRC csharp
interface Foldable<A> {
   B Aggregate<B>(Func<A,B,B> reduce, B initialValue);
}
#+END_SRC

- a list is foldable (this is called ~Aggregate~ in linq).
- an option is foldable (one either "appends" the ~A~ to the default value, or returns the default value).
- task is also foldable!

** Applicative 1/2

This is a step up from Functor, and needs two things:
#+BEGIN_SRC csharp
interface Applicative<A> : Functor<A> {
   // Put a value into the applicative
   Applicative<A> Pure(A value); 
   // Chain functions together
   Applicative<B> Apply(Applicative<Func<A,B>> liftedFunc, Applicative<A> val);
}
#+END_SRC

This seems a little weird, but one should imagine that the ~B~ can be another ~Func<C,D>~, so these ops can be chained.

** Applicative 2/2

This lets us chain together effects but where we don't care about the previous values.

- For an option, we will only apply if everything has a value.
- For a list, we will do a cross product. 
#+BEGIN_SRC csharp
// given an extension:
Applicative<B> Apply(this Applicative<Func<A,B>> f, Applicative<A> a);

new[]{ 2, 3, 4
     , 3, 4, 5
     , 4, 5, 6} = Pure(Plus)
  .Apply(Pure(new []{1,2,3}))
  .Apply(Pure(new []{1,2,3}));
#+END_SRC
- For a task, we wait for all tasks to complete (but run them concurrently).

** Monad

What if we want to have our function have some effect?
We need something slightly more powerfull

#+BEGIN_SRC csharp
interface Monad<A> : Applicative<A> {
   Monad<B> Bind<B>(Func<A,Monad<B>> thingToMap);
}
#+END_SRC

Why?
- A list we might want to do a nested foreach, e.g. foreach element, return a new list.
- An option we might want to chain failure together, e.g. if there was a value, find the next thing that might also have a value.
- A task we will want to continue with the previous value and chain tasks together. This is waaay better than callbacks!

