beardedmonads.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Functional programming and Bearded.Monads</title>
<meta name="author" content="(Khan Thompson)"/>
<link rel="stylesheet" href="http://cdn.jsdelivr.net/reveal.js/3.0.0/css/reveal.css"/>

<link rel="stylesheet" href="http://cdn.jsdelivr.net/reveal.js/3.0.0/css/theme/moon.css" id="theme"/>


<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide"><h1 class="title">Functional programming and Bearded.Monads</h1><h2 class="author">Khan Thompson</h2><p class="date">Created: 2017-09-06 Wed 17:36</p>
</section>

<section>
<section id="slide-orgb26ca39">
<h2 id="orgb26ca39">Functional programming</h2>
<ul>
<li>Programming without changing anything.</li>
<li>Math is function programming is math.</li>

</ul>

</section>
<section id="slide-orgcd57100">
<h3 id="orgcd57100">Why not just mutate, it's easy?</h3>
<ul>
<li>Multi threading.</li>
<li>Equational reasoning.</li>

</ul>

</section>
<section id="slide-orgd7be64a">
<h3 id="orgd7be64a">Why not just use the functional approach?</h3>
<ul>
<li>It's not what we were taught.</li>
<li>It can be awkward.</li>

</ul>

</section>
</section>
<section>
<section id="slide-org0420cb3">
<h2 id="org0420cb3">Some classes</h2>
<ul>
<li>There are some typeclasses (think interfaces) which have unreasonable effectiveness.</li>
<li>They have weird names, so I'll explain them as best I can.</li>

</ul>

</section>
<section id="slide-orgef179a5">
<h3 id="orgef179a5">Functor</h3>
<p>
A container for values, e.g. has a type parameter.
It defines an operation that lets one change the type in the context of the container.
</p>
<div class="org-src-container">

<pre  class="src src-csharp"><span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">We can change the type of the functor from `A` to `B`.</span>
<span style="color: #4f97d7; font-weight: bold;">interface</span> <span style="color: #ce537a; font-weight: bold;">Functor</span><span style="color: #4f97d7;">&lt;</span>A<span style="color: #4f97d7;">&gt;</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #ce537a; font-weight: bold;">Functor</span><span style="color: #bc6ec5;">&lt;</span>B<span style="color: #bc6ec5;">&gt;</span> <span style="color: #bc6ec5; font-weight: bold;">Select</span><span style="color: #bc6ec5;">&lt;</span>B<span style="color: #bc6ec5;">&gt;(</span><span style="color: #ce537a; font-weight: bold;">Func</span><span style="color: #2d9574;">&lt;</span>A,B<span style="color: #2d9574;">&gt;</span> <span style="color: #7590db;">f</span><span style="color: #bc6ec5;">)</span>;
<span style="color: #4f97d7;">}</span>
</pre>
</div>

<ul>
<li>a list is a functor (it contains values).</li>
<li>a task is a functor (it has a value that will be available in time).</li>
<li>an option is a functor (it may or may not have a value).</li>

</ul>

</section>
<section id="slide-org9f6dc2f">
<h3 id="org9f6dc2f">Foldable</h3>
<p>
Something we can reduce to another value, with a function combining each value in the container.
</p>
<div class="org-src-container">

<pre  class="src src-csharp"><span style="color: #4f97d7; font-weight: bold;">interface</span> <span style="color: #ce537a; font-weight: bold;">Foldable</span><span style="color: #4f97d7;">&lt;</span>A<span style="color: #4f97d7;">&gt;</span> <span style="color: #4f97d7;">{</span>
   <span style="color: #ce537a; font-weight: bold;">B</span> <span style="color: #bc6ec5; font-weight: bold;">Aggregate</span><span style="color: #bc6ec5;">&lt;</span><span style="color: #ce537a; font-weight: bold;">B</span><span style="color: #bc6ec5;">&gt;(</span><span style="color: #ce537a; font-weight: bold;">Func</span><span style="color: #2d9574;">&lt;</span>A,<span style="color: #ce537a; font-weight: bold;">B</span>,<span style="color: #ce537a; font-weight: bold;">B</span><span style="color: #2d9574;">&gt;</span> <span style="color: #7590db;">reduce</span>, <span style="color: #ce537a; font-weight: bold;">B</span> <span style="color: #7590db;">initialValue</span><span style="color: #bc6ec5;">)</span>;
<span style="color: #4f97d7;">}</span>
</pre>
</div>

<ul>
<li>a list is foldable (this is called <code>Aggregate</code> in linq).</li>
<li>an option is foldable (one either "appends" the <code>A</code> to the default value, or returns the default value).</li>
<li>task is also foldable!</li>

</ul>

</section>
<section id="slide-org043f913">
<h3 id="org043f913">Applicative</h3>
<p>
This is a step up from Functor, and needs two things:
</p>
<div class="org-src-container">

<pre  class="src src-csharp"><span style="color: #4f97d7; font-weight: bold;">interface</span> <span style="color: #ce537a; font-weight: bold;">Applicative</span><span style="color: #4f97d7;">&lt;</span>A<span style="color: #4f97d7;">&gt;</span> : <span style="color: #ce537a; font-weight: bold;">Functor</span><span style="color: #4f97d7;">&lt;</span>A<span style="color: #4f97d7;">&gt;</span> <span style="color: #4f97d7;">{</span>
   <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Put a value into the applicative</span>
   <span style="color: #ce537a; font-weight: bold;">Applicative</span><span style="color: #bc6ec5;">&lt;</span>A<span style="color: #bc6ec5;">&gt;</span> <span style="color: #bc6ec5; font-weight: bold;">Pure</span><span style="color: #bc6ec5;">(</span><span style="color: #ce537a; font-weight: bold;">A</span> <span style="color: #7590db;">value</span><span style="color: #bc6ec5;">)</span>; 
   <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Chain functions together</span>
   <span style="color: #ce537a; font-weight: bold;">Applicative</span><span style="color: #bc6ec5;">&lt;</span>B<span style="color: #bc6ec5;">&gt;</span> <span style="color: #bc6ec5; font-weight: bold;">Apply</span><span style="color: #bc6ec5;">(</span><span style="color: #ce537a; font-weight: bold;">Applicative</span><span style="color: #2d9574;">&lt;</span><span style="color: #ce537a; font-weight: bold;">Func</span><span style="color: #67b11d;">&lt;</span><span style="color: #ce537a; font-weight: bold;">A</span>,B<span style="color: #67b11d;">&gt;</span><span style="color: #2d9574;">&gt;</span> <span style="color: #7590db;">liftedFunc</span>, <span style="color: #ce537a; font-weight: bold;">Applicative</span><span style="color: #2d9574;">&lt;</span><span style="color: #ce537a; font-weight: bold;">A</span><span style="color: #2d9574;">&gt;</span> <span style="color: #7590db;">val</span><span style="color: #bc6ec5;">)</span>;
<span style="color: #4f97d7;">}</span>
</pre>
</div>

<p>
This seems a little weird, but one should imagine that the <code>B</code> can be another <code>Func&lt;C,D&gt;</code>, so these ops can be chained.
</p>
<div class="org-src-container">

<pre  class="src src-csharp"><span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">given an extension:</span>
<span style="color: #ce537a; font-weight: bold;">Applicative</span><span style="color: #4f97d7;">&lt;</span>B<span style="color: #4f97d7;">&gt;</span> <span style="color: #bc6ec5; font-weight: bold;">Apply</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">this</span> <span style="color: #ce537a; font-weight: bold;">Applicative</span><span style="color: #bc6ec5;">&lt;</span><span style="color: #ce537a; font-weight: bold;">Func</span><span style="color: #2d9574;">&lt;</span>A,B<span style="color: #2d9574;">&gt;</span><span style="color: #bc6ec5;">&gt;</span> f, <span style="color: #ce537a; font-weight: bold;">Applicative</span><span style="color: #bc6ec5;">&lt;</span>A<span style="color: #bc6ec5;">&gt;</span> <span style="color: #7590db;">a</span><span style="color: #4f97d7;">)</span>;

<span style="color: #ce537a; font-weight: bold;">Func</span><span style="color: #4f97d7;">&lt;</span>Int,Int<span style="color: #4f97d7;">&gt;</span> <span style="color: #bc6ec5; font-weight: bold;">CurriedPlus</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">Int</span> <span style="color: #7590db;">x</span><span style="color: #4f97d7;">)</span> =&gt; y =&gt; x + y;

<span style="color: #4f97d7; font-weight: bold;">new</span><span style="color: #4f97d7;">[]{</span> <span style="color: #a45bad;">2</span>, <span style="color: #a45bad;">3</span>, <span style="color: #a45bad;">4</span>
     , <span style="color: #a45bad;">3</span>, <span style="color: #a45bad;">4</span>, <span style="color: #a45bad;">5</span>
     , <span style="color: #a45bad;">4</span>, <span style="color: #a45bad;">5</span>, <span style="color: #a45bad;">6</span><span style="color: #4f97d7;">}</span> 
 == Pure<span style="color: #4f97d7;">(</span>CurriedPlus<span style="color: #4f97d7;">)</span>
  .Apply<span style="color: #4f97d7;">(</span>Pure<span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #2d9574;">[]{</span><span style="color: #a45bad;">1</span>,<span style="color: #a45bad;">2</span>,<span style="color: #a45bad;">3</span><span style="color: #2d9574;">}</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
  .Apply<span style="color: #4f97d7;">(</span>Pure<span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #2d9574;">[]{</span><span style="color: #a45bad;">1</span>,<span style="color: #a45bad;">2</span>,<span style="color: #a45bad;">3</span><span style="color: #2d9574;">}</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>;
</pre>
</div>
</section>
<section id="slide-orgf902181">
<h3 id="orgf902181">Monad</h3>
<p>
What if we want to have our function have some effect?
We need something slightly more powerfull
</p>

<div class="org-src-container">

<pre  class="src src-csharp"><span style="color: #4f97d7; font-weight: bold;">interface</span> <span style="color: #ce537a; font-weight: bold;">Monad</span><span style="color: #4f97d7;">&lt;</span>A<span style="color: #4f97d7;">&gt;</span> : <span style="color: #ce537a; font-weight: bold;">Applicative</span><span style="color: #4f97d7;">&lt;</span>A<span style="color: #4f97d7;">&gt;</span> <span style="color: #4f97d7;">{</span>
   <span style="color: #ce537a; font-weight: bold;">Monad</span><span style="color: #bc6ec5;">&lt;</span>B<span style="color: #bc6ec5;">&gt;</span> <span style="color: #bc6ec5; font-weight: bold;">Bind</span><span style="color: #bc6ec5;">&lt;</span>B<span style="color: #bc6ec5;">&gt;(</span><span style="color: #ce537a; font-weight: bold;">Func</span><span style="color: #2d9574;">&lt;</span>A,<span style="color: #ce537a; font-weight: bold;">Monad</span><span style="color: #67b11d;">&lt;</span>B<span style="color: #67b11d;">&gt;</span><span style="color: #2d9574;">&gt;</span> <span style="color: #7590db;">thingToMap</span><span style="color: #bc6ec5;">)</span>;
<span style="color: #4f97d7;">}</span>
</pre>
</div>

<p>
Why?
</p>
<ul>
<li>A list we might want to do a nested foreach, e.g. foreach element, return a new list.</li>
<li>An option we might want to chain failure together, e.g. if there was a value, find the next thing that might also have a value.</li>
<li>A task we will want to continue with the previous value and chain tasks together. This is waaay better than callbacks!</li>

</ul>

</section>
