beardedmonads.org
** Traversable

The highest order - imagine we want to sequence some effect through something we can fold!

#+BEGIN_SRC csharp
interface Traversable<A> : Applicative<A> {
   Traversable<IEnumerable<B>> Traverse<B>(IEnumerable<A> items, Func<A,Traversable<B>> callback);
}
#+END_SRC

Imagine this takes a sequence of elements, applies to callback to them, then stitches them all together.

- You might have a list of ids that you want to load from the db, and if you don't find them all, you want to return nothing.
- You might have a list of ids that you need to load from an external service, you can use traverse to make the tasks run concurrently.

** Finally

- Functor maps a function over a container.
- Applicative applies functions over a container.
- Monad applies a function to a value in a container, where that function returns something in the container.
- Traverse applies a function to each element in a collections, and sequences the container around the results.

* Types in bearded.monads

- Only some of the types are defined (when they are needed).
- Some of it has been renamed to fit my personal aesthetic.
- It behaves "lawfully".

* Option<A>

- This is the most immediately obvious type.
- It's null safe (i.e. no value you have in ~Option~ will be null).
- Implements Functor, Applicative, Monad and Traverse.
- It has a suite of ergonomics implemented.

#+BEGIN_SRC csharp
class Option<A> {
  private class None : Option<A> {}
  private class Some : Option<A> {
     private A val;
  }
}
#+END_SRC

- If you 100% need a null to be carried in this type, use ~OptionUsafe~.

** Functor

#+BEGIN_SRC csharp
// AsOption is an extension method, and will return None.
Option<string> possibleUsername = "My thing".AsOption();
Option<int> lengthOfUsername = possibleUsername
  .Select(name => name.Length);
#+END_SRC

** Applicative

#+BEGIN_SRC csharp
Option<User> possibleUser = LoadUserFromDb(someIdParam);
Option<Action> possibleAction = 
  LoadActionDetailsFromExternalService(anotherParam);

Bearded.Monads.Syntax // also, using static Bearded.Monads.Syntax;
  .Optionally(possibleUser)
  .And(possibleAction)
  .Then((User user, Action action) => DumpToDb(user, action));
#+END_SRC

** Monad

#+BEGIN_SRC csharp
Option<User> possibleUser = LoadUserFromDb(someIdParam);

Option<Action> LoadActionFromDb(User user) => ...;

Option<Action> possibleUser.SelectMany((User user)
  => LoadActionFromDb(user));

// .. or

Option<SomethingElse> query =
  from user in LoadUserFromDb(someIdParam)
  from action in LoadActionFromDb(user) // depends on the previous value
  select DoSomethingElse(user, action)
#+END_SRC

** Traverse

#+BEGIN_SRC csharp
List<Action> allMyUsers = LoadUserHistory(someIdParam);

Option<Result> GetFinalResultFrom(Action action) => ...;

// Has a value IFF all calls to GetFinalResultFrom return a value
Option<List<Result>> allResultsWhenDone = allMyUsers
  .Traverse((Action action) => GetFinalResultFrom(action));
#+END_SRC

