beardedmonads.html
<section id="slide-orgf173348">
<h3 id="orgf173348">Traversable</h3>
<p>
The highest order - imagine we want to sequence some effect through something we can fold!
</p>

<div class="org-src-container">

<pre  class="src src-csharp"><span style="color: #4f97d7; font-weight: bold;">interface</span> <span style="color: #ce537a; font-weight: bold;">Traversable</span><span style="color: #4f97d7;">&lt;</span>A<span style="color: #4f97d7;">&gt;</span> : <span style="color: #ce537a; font-weight: bold;">Applicative</span><span style="color: #4f97d7;">&lt;</span>A<span style="color: #4f97d7;">&gt;</span> <span style="color: #4f97d7;">{</span>
   <span style="color: #ce537a; font-weight: bold;">Traversable</span><span style="color: #bc6ec5;">&lt;</span><span style="color: #ce537a; font-weight: bold;">IEnumerable</span><span style="color: #2d9574;">&lt;</span>B<span style="color: #2d9574;">&gt;</span><span style="color: #bc6ec5;">&gt;</span> <span style="color: #bc6ec5; font-weight: bold;">Traverse</span><span style="color: #bc6ec5;">&lt;</span>B<span style="color: #bc6ec5;">&gt;(</span><span style="color: #ce537a; font-weight: bold;">IEnumerable</span><span style="color: #2d9574;">&lt;</span>A<span style="color: #2d9574;">&gt;</span> <span style="color: #7590db;">items</span>, <span style="color: #ce537a; font-weight: bold;">Func</span><span style="color: #2d9574;">&lt;</span>A,<span style="color: #ce537a; font-weight: bold;">Traversable</span><span style="color: #67b11d;">&lt;</span>B<span style="color: #67b11d;">&gt;</span><span style="color: #2d9574;">&gt;</span> <span style="color: #7590db;">callback</span><span style="color: #bc6ec5;">)</span>;
<span style="color: #4f97d7;">}</span>
</pre>
</div>

<p>
Imagine this takes a sequence of elements, applies to callback to them, then stitches them all together.
</p>

<ul>
<li>You might have a list of ids that you want to load from the db, and if you don't find them all, you want to return nothing.</li>
<li>You might have a list of ids that you need to load from an external service, you can use traverse to make the tasks run concurrently.</li>

</ul>

</section>
<section id="slide-org74de941">
<h3 id="org74de941">Finally</h3>
<ul>
<li>Functor maps a function over a container.</li>
<li>Applicative applies functions over a container.</li>
<li>Monad applies a function to a value in a container, where that function returns something in the container.</li>
<li>Traverse applies a function to each element in a collections, and sequences the container around the results.</li>

</ul>

</section>
</section>
<section>
<section id="slide-orgc88ebe4">
<h2 id="orgc88ebe4">Types in bearded.monads</h2>
<ul>
<li>Only some of the types are defined (when they are needed).</li>
<li>Some of it has been renamed to fit my personal aesthetic.</li>
<li>It behaves "lawfully".</li>

</ul>

</section>
</section>
<section>
<section id="slide-orgf75b9b0">
<h2 id="orgf75b9b0">Option&lt;A&gt;</h2>
<ul>
<li>This is the most immediately obvious type.</li>
<li>It's null safe (i.e. no value you have in <code>Option</code> will be null).</li>
<li>Implements Functor, Applicative, Monad and Traverse.</li>
<li>It has a suite of ergonomics implemented.</li>

</ul>

<div class="org-src-container">

<pre  class="src src-csharp"><span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">Option</span><span style="color: #4f97d7;">&lt;</span>A<span style="color: #4f97d7;">&gt;</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #4f97d7; font-weight: bold;">private</span> <span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">None</span> : <span style="color: #ce537a; font-weight: bold;">Option</span><span style="color: #bc6ec5;">&lt;</span>A<span style="color: #bc6ec5;">&gt;</span> <span style="color: #bc6ec5;">{}</span>
  <span style="color: #4f97d7; font-weight: bold;">private</span> <span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">Some</span> : <span style="color: #ce537a; font-weight: bold;">Option</span><span style="color: #bc6ec5;">&lt;</span>A<span style="color: #bc6ec5;">&gt;</span> <span style="color: #bc6ec5;">{</span>
     <span style="color: #4f97d7; font-weight: bold;">private</span> <span style="color: #ce537a; font-weight: bold;">A</span> <span style="color: #7590db;">val</span>;
  <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>

<ul>
<li>If you 100% need a null to be carried in this type, use <code>OptionUsafe</code>.</li>

</ul>

</section>
<section id="slide-orge653364">
<h3 id="orge653364">Functor</h3>
<div class="org-src-container">

<pre  class="src src-csharp"><span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">AsOption is an extension method, and will return None.</span>
<span style="color: #ce537a; font-weight: bold;">Option</span><span style="color: #4f97d7;">&lt;</span><span style="color: #ce537a; font-weight: bold;">string</span><span style="color: #4f97d7;">&gt;</span> <span style="color: #7590db;">possibleUsername</span> = <span style="color: #2d9574;">"My thing"</span>.AsOption<span style="color: #4f97d7;">()</span>;
<span style="color: #ce537a; font-weight: bold;">Option</span><span style="color: #4f97d7;">&lt;</span><span style="color: #ce537a; font-weight: bold;">int</span><span style="color: #4f97d7;">&gt;</span> <span style="color: #7590db;">lengthOfUsername</span> = possibleUsername
  .Select<span style="color: #4f97d7;">(</span>name =&gt; name.Length<span style="color: #4f97d7;">)</span>;
</pre>
</div>

</section>
<section id="slide-org442a58e">
<h3 id="org442a58e">Applicative</h3>
<div class="org-src-container">

<pre  class="src src-csharp"><span style="color: #ce537a; font-weight: bold;">Option</span><span style="color: #4f97d7;">&lt;</span>User<span style="color: #4f97d7;">&gt;</span> <span style="color: #7590db;">possibleUser</span> = LoadUserFromDb<span style="color: #4f97d7;">(</span>someIdParam<span style="color: #4f97d7;">)</span>;
<span style="color: #ce537a; font-weight: bold;">Option</span><span style="color: #4f97d7;">&lt;</span>Action<span style="color: #4f97d7;">&gt;</span> <span style="color: #7590db;">possibleAction</span> = 
  LoadActionDetailsFromExternalService<span style="color: #4f97d7;">(</span>anotherParam<span style="color: #4f97d7;">)</span>;

Bearded.Monads.Syntax <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">also, using static Bearded.Monads.Syntax;</span>
  .Optionally<span style="color: #4f97d7;">(</span>possibleUser<span style="color: #4f97d7;">)</span>
  .And<span style="color: #4f97d7;">(</span>possibleAction<span style="color: #4f97d7;">)</span>
  .Then<span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">(</span><span style="color: #ce537a; font-weight: bold;">User</span> <span style="color: #7590db;">user</span>, <span style="color: #ce537a; font-weight: bold;">Action</span> <span style="color: #7590db;">action</span><span style="color: #bc6ec5;">)</span> =&gt; DumpToDb<span style="color: #bc6ec5;">(</span>user, action<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>;
</pre>
</div>

</section>
<section id="slide-org96400b7">
<h3 id="org96400b7">Monad</h3>
<div class="org-src-container">

<pre  class="src src-csharp"><span style="color: #ce537a; font-weight: bold;">Option</span><span style="color: #4f97d7;">&lt;</span>User<span style="color: #4f97d7;">&gt;</span> <span style="color: #7590db;">possibleUser</span> = LoadUserFromDb<span style="color: #4f97d7;">(</span>someIdParam<span style="color: #4f97d7;">)</span>;

<span style="color: #ce537a; font-weight: bold;">Option</span><span style="color: #4f97d7;">&lt;</span>Action<span style="color: #4f97d7;">&gt;</span> <span style="color: #bc6ec5; font-weight: bold;">LoadActionFromDb</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">User</span> <span style="color: #7590db;">user</span><span style="color: #4f97d7;">)</span> =&gt; ...;

<span style="color: #ce537a; font-weight: bold;">Option</span><span style="color: #4f97d7;">&lt;</span>Action<span style="color: #4f97d7;">&gt;</span> possibleUser.<span style="color: #bc6ec5; font-weight: bold;">SelectMany</span><span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">(</span><span style="color: #ce537a; font-weight: bold;">User</span> <span style="color: #7590db;">user</span><span style="color: #bc6ec5;">)</span>
  =&gt; LoadActionFromDb<span style="color: #bc6ec5;">(</span><span style="color: #ce537a; font-weight: bold;">user</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>;

<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">.. or</span>

<span style="color: #ce537a; font-weight: bold;">Option</span><span style="color: #4f97d7;">&lt;</span>SomethingElse<span style="color: #4f97d7;">&gt;</span> <span style="color: #7590db;">query</span> =
  <span style="color: #4f97d7; font-weight: bold;">from</span> user <span style="color: #4f97d7; font-weight: bold;">in</span> LoadUserFromDb<span style="color: #4f97d7;">(</span>someIdParam<span style="color: #4f97d7;">)</span>
  <span style="color: #4f97d7; font-weight: bold;">from</span> action <span style="color: #4f97d7; font-weight: bold;">in</span> LoadActionFromDb<span style="color: #4f97d7;">(</span>user<span style="color: #4f97d7;">)</span> <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">depends on the previous value</span>
  <span style="color: #4f97d7; font-weight: bold;">select</span> DoSomethingElse<span style="color: #4f97d7;">(</span>user, action<span style="color: #4f97d7;">)</span>
</pre>
</div>

</section>
<section id="slide-orgf7474b2">
<h3 id="orgf7474b2">Traverse</h3>
<div class="org-src-container">

<pre  class="src src-csharp"><span style="color: #ce537a; font-weight: bold;">List</span><span style="color: #4f97d7;">&lt;</span>Action<span style="color: #4f97d7;">&gt;</span> <span style="color: #7590db;">allMyUsers</span> = LoadUserHistory<span style="color: #4f97d7;">(</span>someIdParam<span style="color: #4f97d7;">)</span>;

<span style="color: #ce537a; font-weight: bold;">Option</span><span style="color: #4f97d7;">&lt;</span>Result<span style="color: #4f97d7;">&gt;</span> <span style="color: #bc6ec5; font-weight: bold;">GetFinalResultFrom</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">Action</span> <span style="color: #7590db;">action</span><span style="color: #4f97d7;">)</span> =&gt; ...;

<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Has a value IFF all calls to GetFinalResultFrom return a value</span>
<span style="color: #ce537a; font-weight: bold;">Option</span><span style="color: #4f97d7;">&lt;</span><span style="color: #ce537a; font-weight: bold;">List</span><span style="color: #bc6ec5;">&lt;</span>Result<span style="color: #bc6ec5;">&gt;</span><span style="color: #4f97d7;">&gt;</span> <span style="color: #7590db;">allResultsWhenDone</span> = allMyUsers
  .Traverse<span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">(</span><span style="color: #ce537a; font-weight: bold;">Action</span> <span style="color: #7590db;">action</span><span style="color: #bc6ec5;">)</span> =&gt; GetFinalResultFrom<span style="color: #bc6ec5;">(</span>action<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>;
</pre>
</div>

</section>
</section>
