beardedmonads.org
* Try<A>

- Exception handling.
- Like ~Option~ but it has a failure value, an exception.
- Implements Functor, Monad, Traverse.
- Join all your potential failures into one that will short circuit.
- If you need something with a error value other than exception, use ~Either~

#+BEGIN_SRC csharp
class Try<A> {
  private class Error : Try<A> {
    private Exception val;
  }
  private class Success : Try<A> {
    private A val;
  }
}
#+END_SRC

** Functor

#+BEGIN_SRC csharp
Try<User> possibleUser = dbConnectionFactory
  .SafeCallback(factory => factory.OpenConnection())
  .Select(connection => connection.LoadUser(someIdParam));
#+END_SRC

** Why no applicative?

- Applicative runs "all at once".
- Which exception should we pick?
- This is a different type (which I have implemented yet ;)).

** Monad

#+BEGIN_SRC csharp
Try<User> possibleUser = ...;
Try<Action> LoadAction(User user) => ...;

Try<Action> finalResult = possibleUser
  .SelectMany((User user) => LoadAction(user));

Try<Result> query =
  from user in possibleUser
  from action in LoadAction(user)
  select SomeResultFrom(user, action);
#+END_SRC

** Traverse

- This cheats a little and uses the Monad instead of the applicative.

#+BEGIN_SRC csharp
List<Action> allMyUsers = LoadUserHistory(someIdParam);

Try<Result> GetFinalResultFrom(Action action) => ...;

// Has a value IFF no calls threw an exception
Try<List<Result>> allResultsWhenDone = allMyUsers
  .Traverse((Action action) => GetFinalResultFrom(action));
#+END_SRC

* Task<A>

- Task also fits nicely into all this
- Implements Functor, Applicative, Monad and Traverse
- Much nicely than chaining, although it's similar to ~await~ etc.

** Functor

- This instance exists for completeness.
- It may or may not be nicer to use than just await
- Whichever is the most intention revealing!

#+BEGIN_SRC csharp
Task<UserName> eventualUser = LoadUser(someIdParam)
  .Select((User user) => user.Name);

// compares:

User user = await LoadUser(someIdParam);
return user.Name;
#+END_SRC

** Applicative

Super awesome!
#+BEGIN_SRC csharp
using static Bearded.Monads.Syntax;
// other things

Asynquence(LoadUserAsync(..))
  .And(LoadActionAsync(..))
  .And(LoadAnotherAsync(..))
  .Then((User user, Action action, Another another) 
    => DoTheThing(user, action, another);

// Compare
Task<User> userTask = LoadUserAsync(..);
Task<Action> actionTask = LoadActionAsync(..);
Task<Another> anotherTask = LoadAnotherAsync(..);

Task.WaitAll(userTask, actionTask, anotherTask); 
DoTheThing(userTask.Result, actionTask.Result, anotherTask.Result);
#+END_SRC

