beardedmonads.html
<section>
<section id="slide-orga0dc575">
<h2 id="orga0dc575">Try&lt;A&gt;</h2>
<ul>
<li>Exception handling.</li>
<li>Like <code>Option</code> but it has a failure value, an exception.</li>
<li>Implements Functor, Monad, Traverse.</li>
<li>Join all your potential failures into one that will short circuit.</li>
<li>If you need something with a error value other than exception, use <code>Either</code></li>

</ul>

<div class="org-src-container">

<pre  class="src src-csharp"><span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">Try</span><span style="color: #4f97d7;">&lt;</span>A<span style="color: #4f97d7;">&gt;</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #4f97d7; font-weight: bold;">private</span> <span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">Error</span> : <span style="color: #ce537a; font-weight: bold;">Try</span><span style="color: #bc6ec5;">&lt;</span>A<span style="color: #bc6ec5;">&gt;</span> <span style="color: #bc6ec5;">{</span>
    <span style="color: #4f97d7; font-weight: bold;">private</span> <span style="color: #ce537a; font-weight: bold;">Exception</span> <span style="color: #7590db;">val</span>;
  <span style="color: #bc6ec5;">}</span>
  <span style="color: #4f97d7; font-weight: bold;">private</span> <span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">Success</span> : <span style="color: #ce537a; font-weight: bold;">Try</span><span style="color: #bc6ec5;">&lt;</span>A<span style="color: #bc6ec5;">&gt;</span> <span style="color: #bc6ec5;">{</span>
    <span style="color: #4f97d7; font-weight: bold;">private</span> <span style="color: #ce537a; font-weight: bold;">A</span> <span style="color: #7590db;">val</span>;
  <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>

</section>
<section id="slide-org79eb7a8">
<h3 id="org79eb7a8">Functor</h3>
<div class="org-src-container">

<pre  class="src src-csharp"><span style="color: #ce537a; font-weight: bold;">Try</span><span style="color: #4f97d7;">&lt;</span>User<span style="color: #4f97d7;">&gt;</span> <span style="color: #7590db;">possibleUser</span> = dbConnectionFactory
  .SafeCallback<span style="color: #4f97d7;">(</span>factory =&gt; factory.OpenConnection<span style="color: #bc6ec5;">()</span><span style="color: #4f97d7;">)</span>
  .Select<span style="color: #4f97d7;">(</span>connection =&gt; connection.LoadUser<span style="color: #bc6ec5;">(</span>someIdParam<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>;
</pre>
</div>

</section>
<section id="slide-org294a6ca">
<h3 id="org294a6ca">Why no applicative?</h3>
<ul>
<li>Applicative runs "all at once".</li>
<li>Which exception should we pick?</li>
<li>This is a different type (which I have implemented yet ;)).</li>

</ul>

</section>
<section id="slide-orgd918cf3">
<h3 id="orgd918cf3">Monad</h3>
<div class="org-src-container">

<pre  class="src src-csharp"><span style="color: #ce537a; font-weight: bold;">Try</span><span style="color: #4f97d7;">&lt;</span>User<span style="color: #4f97d7;">&gt;</span> <span style="color: #7590db;">possibleUser</span> = ...;
<span style="color: #ce537a; font-weight: bold;">Try</span><span style="color: #4f97d7;">&lt;</span>Action<span style="color: #4f97d7;">&gt;</span> <span style="color: #bc6ec5; font-weight: bold;">LoadAction</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">User</span> <span style="color: #7590db;">user</span><span style="color: #4f97d7;">)</span> =&gt; ...;

<span style="color: #ce537a; font-weight: bold;">Try</span><span style="color: #4f97d7;">&lt;</span>Action<span style="color: #4f97d7;">&gt;</span> <span style="color: #7590db;">finalResult</span> = possibleUser
  .SelectMany<span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">(</span><span style="color: #ce537a; font-weight: bold;">User</span> <span style="color: #7590db;">user</span><span style="color: #bc6ec5;">)</span> =&gt; LoadAction<span style="color: #bc6ec5;">(</span>user<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>;

<span style="color: #ce537a; font-weight: bold;">Try</span><span style="color: #4f97d7;">&lt;</span>Result<span style="color: #4f97d7;">&gt;</span> <span style="color: #7590db;">query</span> =
  <span style="color: #4f97d7; font-weight: bold;">from</span> user <span style="color: #4f97d7; font-weight: bold;">in</span> possibleUser
  <span style="color: #4f97d7; font-weight: bold;">from</span> action <span style="color: #4f97d7; font-weight: bold;">in</span> LoadAction<span style="color: #4f97d7;">(</span>user<span style="color: #4f97d7;">)</span>
  <span style="color: #4f97d7; font-weight: bold;">select</span> SomeResultFrom<span style="color: #4f97d7;">(</span>user, action<span style="color: #4f97d7;">)</span>;
</pre>
</div>

</section>
<section id="slide-org8ff1bd2">
<h3 id="org8ff1bd2">Traverse</h3>
<ul>
<li>This cheats a little and uses the Monad instead of the applicative.</li>

</ul>

<div class="org-src-container">

<pre  class="src src-csharp"><span style="color: #ce537a; font-weight: bold;">List</span><span style="color: #4f97d7;">&lt;</span>Action<span style="color: #4f97d7;">&gt;</span> <span style="color: #7590db;">allMyUsers</span> = LoadUserHistory<span style="color: #4f97d7;">(</span>someIdParam<span style="color: #4f97d7;">)</span>;

<span style="color: #ce537a; font-weight: bold;">Try</span><span style="color: #4f97d7;">&lt;</span>Result<span style="color: #4f97d7;">&gt;</span> <span style="color: #bc6ec5; font-weight: bold;">GetFinalResultFrom</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">Action</span> <span style="color: #7590db;">action</span><span style="color: #4f97d7;">)</span> =&gt; ...;

<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Has a value IFF no calls threw an exception</span>
<span style="color: #ce537a; font-weight: bold;">Try</span><span style="color: #4f97d7;">&lt;</span><span style="color: #ce537a; font-weight: bold;">List</span><span style="color: #bc6ec5;">&lt;</span>Result<span style="color: #bc6ec5;">&gt;</span><span style="color: #4f97d7;">&gt;</span> <span style="color: #7590db;">allResultsWhenDone</span> = allMyUsers
  .Traverse<span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">(</span><span style="color: #ce537a; font-weight: bold;">Action</span> <span style="color: #7590db;">action</span><span style="color: #bc6ec5;">)</span> =&gt; GetFinalResultFrom<span style="color: #bc6ec5;">(</span>action<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>;
</pre>
</div>

</section>
</section>
<section>
<section id="slide-org3bdda64">
<h2 id="org3bdda64">Task&lt;A&gt;</h2>
<ul>
<li>Task also fits nicely into all this</li>
<li>Implements Functor, Applicative, Monad and Traverse</li>
<li>Much nicely than chaining, although it's similar to <code>await</code> etc.</li>

</ul>

</section>
<section id="slide-orge8952e6">
<h3 id="orge8952e6">Functor</h3>
<ul>
<li>This instance exists for completeness.</li>
<li>It may or may not be nicer to use than just await</li>
<li>Whichever is the most intention revealing!</li>

</ul>

<div class="org-src-container">

<pre  class="src src-csharp"><span style="color: #ce537a; font-weight: bold;">Task</span><span style="color: #4f97d7;">&lt;</span>UserName<span style="color: #4f97d7;">&gt;</span> <span style="color: #7590db;">eventualUser</span> = LoadUser<span style="color: #4f97d7;">(</span>someIdParam<span style="color: #4f97d7;">)</span>
  .Select<span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">(</span><span style="color: #ce537a; font-weight: bold;">User</span> <span style="color: #7590db;">user</span><span style="color: #bc6ec5;">)</span> =&gt; user.Name<span style="color: #4f97d7;">)</span>;

<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">compares:</span>

<span style="color: #ce537a; font-weight: bold;">User</span> <span style="color: #7590db;">user</span> = <span style="color: #4f97d7; font-weight: bold;">await</span> LoadUser<span style="color: #4f97d7;">(</span>someIdParam<span style="color: #4f97d7;">)</span>;
<span style="color: #4f97d7; font-weight: bold;">return</span> user.Name;
</pre>
</div>

</section>
<section id="slide-org0768aa5">
<h3 id="org0768aa5">Applicative</h3>
<p>
Super awesome!
</p>
<div class="org-src-container">

<pre  class="src src-csharp"><span style="color: #4f97d7; font-weight: bold;">using</span> <span style="color: #4f97d7; font-weight: bold;">static</span> Bearded.Monads.Syntax;
<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">other things</span>

Asynquence<span style="color: #4f97d7;">(</span>LoadUserAsync<span style="color: #bc6ec5;">(</span>..<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
  .And<span style="color: #4f97d7;">(</span>LoadActionAsync<span style="color: #bc6ec5;">(</span>..<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
  .And<span style="color: #4f97d7;">(</span>LoadAnotherAsync<span style="color: #bc6ec5;">(</span>..<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
  .Then<span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">(</span><span style="color: #ce537a; font-weight: bold;">User</span> <span style="color: #7590db;">user</span>, <span style="color: #ce537a; font-weight: bold;">Action</span> <span style="color: #7590db;">action</span>, <span style="color: #ce537a; font-weight: bold;">Another</span> <span style="color: #7590db;">another</span><span style="color: #bc6ec5;">)</span> 
    =&gt; DoTheThing<span style="color: #bc6ec5;">(</span>user, action, another<span style="color: #bc6ec5;">)</span>;

<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Compare</span>
<span style="color: #ce537a; font-weight: bold;">Task</span><span style="color: #bc6ec5;">&lt;</span><span style="color: #ce537a; font-weight: bold;">User</span><span style="color: #bc6ec5;">&gt;</span> <span style="color: #7590db;">userTask</span> = LoadUserAsync<span style="color: #bc6ec5;">(</span>..<span style="color: #bc6ec5;">)</span>;
<span style="color: #ce537a; font-weight: bold;">Task</span><span style="color: #bc6ec5;">&lt;</span><span style="color: #ce537a; font-weight: bold;">Action</span><span style="color: #bc6ec5;">&gt;</span> <span style="color: #7590db;">actionTask</span> = LoadActionAsync<span style="color: #bc6ec5;">(</span>..<span style="color: #bc6ec5;">)</span>;
<span style="color: #ce537a; font-weight: bold;">Task</span><span style="color: #bc6ec5;">&lt;</span><span style="color: #ce537a; font-weight: bold;">Another</span><span style="color: #bc6ec5;">&gt;</span> <span style="color: #7590db;">anotherTask</span> = LoadAnotherAsync<span style="color: #bc6ec5;">(</span>..<span style="color: #bc6ec5;">)</span>;

Task.WaitAll<span style="color: #bc6ec5;">(</span>userTask, actionTask, anotherTask<span style="color: #bc6ec5;">)</span>; 
DoTheThing<span style="color: #bc6ec5;">(</span>userTask.Result, actionTask.Result, anotherTask.Result<span style="color: #bc6ec5;">)</span>;
</pre>
</div>

</section>
